# IsValidBeginningIndent Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..IsValidBeginningIndent Method
DividedPath Class See Also
---
Checks that the indent value does not cause the beginningIndent and endIndent to overlop
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsValidBeginningIndent(
	double beginningIndent
)
```

Visual Basic
---
```text
Public Function IsValidBeginningIndent ( _
	beginningIndent As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidBeginningIndent(
	double beginningIndent
)
```

# ### Parameters
beginningIndent
    Type: System..::..Double
# See Also
DividedPath Class
Autodesk.Revit.DB Namespace